# vim: ft=conf
tap 'Homebrew/homebrew-autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'superbrothers/opener'
tap 'dimentium/autoraise'
tap 'hashicorp/tap'
tap 'FelixKratz/formulae'
tap 'theseal/blank-screensaver'

cask_args appdir: "~/Applications", require_sha: true, no_quarantine: true

# Apps
cask 'brave-browser'
cask 'dockdoor'
cask 'flux'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'key-codes'
cask 'kitty'
cask 'maccy'
cask 'macs-fan-control'
cask 'monitorcontrol'
cask 'neovim'
cask 'qbserve'
cask 'rectangle'
cask 'screenfocus'
cask 'stats'
cask 'time-out'
cask 'wezterm'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Fantastical', id: 975937182

brew 'autoraise', args: ['with-dexperimental_focus_first'], restart_service: true
brew 'bash'
brew 'bind'  # to get `dig` command
brew 'coreutils'
brew 'curl'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'fontforge'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'go'    # to build Kitty from source
brew 'grc'
brew 'grep'
brew 'hashicorp/tap/vault'
brew 'jq'    # for youtube-dl/download.sh to work
brew 'less'
brew 'lf'
brew 'lima'
brew 'mas'
brew 'neovim'
brew 'ripgrep'
brew 'rsync'
brew 'stow'
brew 'telnet'
brew 'trash'
brew 'wget'
brew 'xh'
brew 'yt-dlp'

brew 'corkscrew'
brew 'noti'
brew 'opener'

brew 'ffmpeg'
brew 'atomicparsley'
