# vim: ft=conf
tap 'Homebrew/homebrew-autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'superbrothers/opener'
tap 'hashicorp/tap'
tap 'anhpt379/homebrew-neovim-nightly'

cask_args appdir: "~/Applications", require_sha: true, no_quarantine: true

# Apps
cask 'alt-tab'
cask 'brave-browser'
cask 'font-fira-code'
cask 'font-meslo-lg-nerd-font'
cask 'google-chrome'
cask 'hiddenbar'
cask 'karabiner-elements'
cask 'key-codes'
cask 'kitty'
cask 'maccy'
cask 'macdown'
cask 'neovim-nightly'
cask 'qbserve'
cask 'rectangle'
cask 'slack'
cask 'stats'
cask 'syntax-highlight'
cask 'the-unarchiver'
cask 'tomatobar'
cask 'topnotch'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Be Focus', id: 961632517
mas 'Fantastical', id: 975937182

brew 'bash'
brew 'bind'  # to get `dig` command
brew 'coreutils'
brew 'curl'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'go'    # to build Kitty from source
brew 'gnu-sed'
brew 'grc'
brew 'grep'
brew 'hashicorp/tap/vault'
brew 'jq'    # for youtube-dl/download.sh to work
brew 'less'
brew 'lf'
brew 'lima'
brew 'mas'
brew 'neovim'
brew 'ripgrep'
brew 'rsync'
brew 'stow'
brew 'telnet'
brew 'trash'
brew 'wget'
brew 'xh'
brew 'yt-dlp'

brew 'corkscrew'
brew 'noti'
brew 'opener'

brew 'ffmpeg'
brew 'atomicparsley'
