tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"

brew "autoconf"
brew "bash"
brew "coreutils"
brew "https://raw.githubusercontent.com/cloudflare/homebrew-cloudflare/master/curl.rb", args: ["HEAD", "build-from-source"]
brew "exa"
brew "fd"
brew "fish"
brew "gawk"
brew "git"
brew "hadolint"
brew "kubernetes-cli"
brew "kubectx"
brew "neovim"
brew "node"
brew "openssl"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "tmux"
brew "trash"
brew "youtube-dl"
brew "languagetool"
brew "shellcheck"
brew "wget"
brew "libxml2"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["with-jansson",
"HEAD"]

# Apps
cask '1password'
cask 'hiddenbar'
cask 'docker'
cask 'google-chrome'
cask 'hosts'
cask 'imageoptim'
cask 'qbserve'
cask 'telegram-desktop'
cask 'the-unarchiver'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Be Focus', id: 961632517
mas 'Amphetamine', id: 937984704
mas 'Fantastical', id: 975937182
mas 'Spark', id: 1176895641
