# vim: ft=conf
tap 'domt4/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'microsoft/git'
tap 'universal-ctags/universal-ctags'

brew 'ansible-lint'
brew 'autoconf'
brew 'bash'
brew 'bat'
brew 'clipper'
brew 'codespell'
brew 'coreutils'
brew 'cowsay'
brew 'ctop'
brew 'curl'
brew 'diff-so-fancy'
brew 'dive'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fx'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'grc'
brew 'grep'
brew 'gron'
brew 'hadolint'
brew 'helm'
brew 'httpstat'
brew 'hyperkit'
brew 'imagemagick'
brew 'ipython'
brew 'jq'
brew 'jsonlint'
brew 'kubectl'
brew 'kubernetes-cli'
brew 'less'
brew 'lf'
brew 'libxml2'
brew 'lolcat'
brew 'luarocks'
brew 'mas'
brew 'minikube'
brew 'ncdu'
brew 'neovim', args: ['HEAD']
brew 'node'
brew 'noti'
brew 'openssl'
brew 'openstackclient'
brew 'prettier'
brew 'pwgen'
brew 'python3'
brew 'ripgrep'
brew 'rsync'
brew 'shellcheck'
brew 'stow'
brew 'telnet'
brew 'terminal-notifier'
brew 'terraform'
brew 'tldr'
brew 'tmux'
brew 'tokei'
brew 'trash'
brew 'txn2/tap/kubefwd'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['with-jansson', 'HEAD']
brew 'vale'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'xh'
brew 'yamllint'
brew 'yarn'
brew 'youtube-dl'

# Apps
cask '1password'
cask 'alt-tab'
cask 'clock-bar'
cask 'docker'
cask 'font-fira-code'
cask 'haptickey'
cask 'hiddenbar'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kitty'
cask 'maccy'
cask 'macdown'
cask 'pock'
cask 'qbserve'
cask 'rectangle'
cask 'scalar'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'unshaky'
cask 'vagrant'
cask 'virtualbox'
cask 'workplace-chat'

# QuickLook plugins
#
# Do this to active these plugins after installing
#
# $ sudo xattr -cr ~/Library/QuickLook/*
# $ qlmanage -r
# $ qlmanage -r cache
# $ killall Finder
#
cask 'qlmarkdown'
cask 'qlstephen'

# Fonts
cask 'font-meslo-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Be Focus', id: 961632517
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
