# vim set ft=conf
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'universal-ctags/universal-ctags'

brew 'autoconf'
brew 'bash'
brew 'bat'
brew 'clipper'
brew 'coreutils'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'hadolint'
brew 'https://raw.githubusercontent.com/cloudflare/homebrew-cloudflare/master/curl.rb', args: ['HEAD', 'build-from-source']
brew 'imagemagick'
brew 'ipython'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'languagetool'
brew 'less'
brew 'lf'
brew 'libxml2'
brew 'mas'
brew 'ncdu'
brew 'neovim'
brew 'node'
brew 'noti'
brew 'openssl'
brew 'pwgen'
brew 'python3'
brew 'ripgrep'
brew 'rsync'
brew 'shellcheck'
brew 'stow'
brew 'telnet'
brew 'tmux'
brew 'tokei'
brew 'trash'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['with-jansson', 'HEAD']
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brwe 'diff-so-fancy'

# Apps
cask '1password'
cask 'docker'
cask 'hiddenbar'
cask 'hyperdock'
cask 'hyperswitch'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'macdown'
cask 'qbserve'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'vagrant'
cask 'workplace-chat'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Fonts
cask 'font-meslo-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Be Focus', id: 961632517
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
