# vim: ft=conf
tap 'Homebrew/homebrew-autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

# Apps
cask 'alt-tab'
cask 'developerexcuses'
cask 'google-chrome'
cask 'hiddenbar'
cask 'karabiner-elements'
cask 'key-codes'
cask 'kitty'
cask 'maccy'
cask 'macdown'
cask 'qbserve'
cask 'rectangle'
cask 'stats'
cask 'the-unarchiver'
cask 'topnotch'
cask 'utm'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Be Focus', id: 961632517
mas 'Fantastical', id: 975937182

brew 'bash'
brew 'bind'  # to get `dig` command
brew 'coreutils'
brew 'jq'    # for youtube-dl/download.sh to work
brew 'curl'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'grc'
brew 'grep'
brew 'less'
brew 'lf'
brew 'neovim'
brew 'ripgrep'
brew 'rsync'
brew 'stow'
brew 'telnet'
brew 'trash'
brew 'wget'
brew 'xh'

brew 'corkscrew'
brew 'noti'
brew 'superbrothers/opener/opener'

brew 'ffmpeg'
brew 'youtube-dl'
