# vim: ft=conf
tap 'domt4/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'universal-ctags/universal-ctags'

brew 'autoconf'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'exa'
brew 'fish'
brew 'gawk'
brew 'gnu-sed'
brew 'grep'
brew 'less'
brew 'minikube'
brew 'noti'
brew 'python3'
brew 'rsync'
brew 'stow'
brew 'telnet'
brew 'trash'
brew 'wget'

# Apps
cask '1password'
cask 'alt-tab'
cask 'docker'
cask 'font-fira-code'
cask 'haptickey'
cask 'hiddenbar'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'kitty'
cask 'maccy'
cask 'macdown'
cask 'pock'
cask 'qbserve'
cask 'rectangle'
cask 'scalar'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'

# QuickLook plugins
#
# Do this to active these plugins after installing
#
# $ sudo xattr -cr ~/Library/QuickLook/*
# $ qlmanage -r
# $ qlmanage -r cache
# $ killall Finder
#
cask 'qlmarkdown'
cask 'qlstephen'

# Fonts
cask 'font-meslo-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Be Focus', id: 961632517
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
